import { FormatStyle, makeReverseMap } from "./util";

export const boldMap: Record<string, string> = { 
    a: "𝗮", b: "𝗯", c: "𝗰", d: "𝗱", e: "𝗲", f: "𝗳", g: "𝗴", h: "𝗵", i: "𝗶", j: "𝗷", 
    k: "𝗸", l: "𝗹", m: "𝐦", n: "𝗻", o: "𝗼", p: "𝗽", q: "𝗾", r: "𝗿", s: "𝘀", t: "𝘁", 
    u: "𝘂", v: "𝘃", w: "𝘄", x: "𝘅", y: "𝘆", z: "𝘇",
    A: "𝐀", B: "𝐁", C: "𝐂", D: "𝐃", E: "𝐄", F: "𝐅", G: "𝐆", H: "𝐇", I: "𝐈", J: "𝐉", 
    K: "𝐊", L: "𝐋", M: "𝐌", N: "𝐍", O: "𝐎", P: "𝐏", Q: "𝐐", R: "𝐑", S: "𝐒", T: "𝐓", 
    U: "𝐔", V: "𝐕", W: "𝐖", X: "𝐗", Y: "𝐘", Z: "𝐙",
};

export const boldStyle: FormatStyle = {
  map: boldMap,
  reverse: makeReverseMap(boldMap),
};



// const und = "𝚊̲𝚋̲𝚌̲𝚍̲𝚎̲𝚏̲𝚐̲𝚑̲𝚒̲𝚓̲𝚔̲𝚕̲𝚖̲𝚗̲𝚘̲𝚙̲𝚚̲𝚞̲𝚜̲𝚝̲𝚞̲𝚟̲𝚠̲𝚡̲𝚢̲𝚣̲𝙰̲𝙱̲𝙲̲𝙳̲𝙴̲𝙵̲𝙶̲𝙷̲𝙸̲𝙹̲𝙺̲𝙻̲𝙼̲𝙽̲𝙾̲𝙿̲𝚀̲𝚁̲𝚂̲𝚃̲𝚄̲𝚅̲𝚉̲𝚇̲𝚈̲𝚉̲𝟶̲𝟷̲𝟷̲𝟸̲𝟹̲𝟺̲𝟻̲𝟼̲𝟽̲𝟾̲𝟿̲"
// const strik = "𝚊̶𝚋̶𝚌̶𝚍̶𝚎̶𝚏̶𝚐̶𝚑̶𝚒̶𝚓̶𝚔̶𝚕̶𝚖̶𝚗̶𝚘̶𝚙̶𝚚̶𝚞̶𝚜̶𝚝̶𝚞̶𝚟̶𝚠̶𝚡̶𝚢̶𝚣̶𝙰̶𝙱̶𝙲̶𝙳̶𝙴̶𝙵̶𝙶̶𝙷̶𝙸̶𝙹̶𝙺̶𝙻̶𝙼̶𝙽̶𝙾̶𝙿̶𝚀̶𝚁̶𝚂̶𝚃̶𝚄̶𝚅̶𝚉̶𝚇̶𝚈̶𝚉̶𝟶̶𝟷̶𝟷̶𝟸̶𝟹̶𝟺̶𝟻̶𝟼̶𝟽̶𝟾̶𝟿̶"
// const bld = "𝗮𝗯𝗰𝗱𝗲𝗳𝗴𝗵𝗶𝗷𝗸𝗹𝗺𝗻𝗼𝗽𝗾𝘂𝘀𝘁𝘂𝘃𝘄𝘅𝘆𝘇𝗔𝗕𝗖𝗗𝗘𝗙𝗚𝗛𝗜𝗝𝗞𝗟𝗠𝗡𝗢𝗣𝗤𝗥𝗦𝗧𝗨𝗩𝗭𝗫𝗬𝗭𝟬𝟭𝟭𝟮𝟯𝟰𝟱𝟲𝟳𝟴𝟵"
// const ita = "𝘢𝘣𝘤𝘥𝘦𝘧𝘨𝘩𝘪𝘫𝘬𝘭𝘮𝘯𝘰𝘱𝘲𝘶𝘴𝘵𝘶𝘷𝘸𝘹𝘺𝘻𝘈𝘉𝘊𝘋𝘌𝘍𝘎𝘏𝘐𝘑𝘒𝘓𝘔𝘕𝘖𝘗𝘘𝘙𝘚𝘛𝘜𝘝𝘡𝘟𝘠𝘡01123456789"
// const und2="a̲b̲c̲d̲e̲f̲g̲h̲i̲j̲k̲l̲m̲n̲o̲p̲q̲r̲s̲t̲u̲v̲w̲x̲y̲z̲A̲B̲C̲D̲E̲F̲G̲H̲I̲J̲K̲L̲M̲N̲O̲P̲Q̲R̲S̲T̲U̲V̲W̲X̲Y̲Z̲0̲1̲2̲3̲4̲5̲6̲7̲8̲9̲"